Конфигурация/Catalogs/КорзиныОФЗПК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>КорзиныОФЗПК</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Корзина</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОФЗПК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Enums/ВидыГосударственныхОблигаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыГосударственныхОблигаций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ГКО</Name>
					<Comment>Государственная краткосрочная облигация</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОФЗ</Name>
					<Comment>Облигация федерального займа</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОВОЗРФ</Name>
					<Comment>Облигации внешних облигационных займов РФ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОВОЗ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ТипыОблигаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыОблигаций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дисконтная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КупоннаяПД</Name>
					<Comment>С фиксированной процентной ставкой</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КупоннаяПК</Name>
					<Comment>С переменным купоном</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Catalogs/КорзиныОФЗПК/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ЗаполнитьНаименование()
	
	Объект.Наименование = "Корзина ОФЗ-ПК на " + Формат(Объект.Дата, "ДФ=dd.MM.yyyy") + " для " + СокрЛП(Объект.Клиент);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()

	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Если Объект.Дата = '00010101' Тогда
			Объект.Дата = ТекущаяДата();
		КонецЕсли;
		
		Если Объект.Организация = Справочники.Организации.ПустаяСсылка() Тогда
			Объект.Организация = ПараметрыСеанса.ТекущаяОрганизация;	
		КонецЕсли;
		
		Если Объект.Наименование = "" Тогда
			ЗаполнитьНаименование();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКорзину()

	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Облигации.Ссылка КАК ОФЗПК
		|ИЗ
		|	Справочник.Облигации КАК Облигации
		|ГДЕ
		|	Облигации.Подкатегория = ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхОблигаций.ОФЗ)
		|	И Облигации.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОблигаций.КупоннаяПК)
		|	И Облигации.ДатаРегистрации <= &Период
		|	И Облигации.ДатаПогашения > &Период
		|	И НЕ Облигации.Амортизационная
		|
		|УПОРЯДОЧИТЬ ПО
		|	Облигации.Наименование");
	
	Запрос.УстановитьПараметр("Период", Объект.Дата);

	Объект.Корзина.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	ЗаполнитьКорзину();
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	ЗаполнитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ЗаполнитьНаименование();
КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
КонецПроцедуры
